''''Task_1______________________________________________________________________________________________


from sys import argv

def zp():
    try:
        t, p, b = map(float, argv[1:])
        print(f'zp - {t * p + b}')
    except ValueError:
         print ('По заданным параметпам не удалось произвести расчет')



zp()


Task_2 ______________________________________________________________________________________________


list_1 = [23, 67, 889, 78, 1, 8, 9, 10]
new_list = [list_1[num] for num in range(1, len(list_1)) if list_1[num] > list_1[num - 1]]
print(new_list)




Task_3 ______________________________________________________________________________________________



list_1 = [i for i  in range(20, 241) if i % 20 == 0 or i % 21 == 0]
print(list_1)





Task_4 ______________________________________________________________________________________________


from random import randint

list_1 = [randint(-10, 10) for i in range(20)]
list_2 = [n for n in list_1 if list_1.count(n) == 1]
print(f'Мой рандомный список\n{list_1}\nСписок с неповторяющимися эл-ми, полученный из рандомного\n{list_2}')




Task_5 ______________________________________________________________________________________________



from functools import reduce


def list_1(n_1, n_2):
    return n_1 * n_2


list_2 = [n for n in range(100, 1001, 2)]
print(f'Начальный список\n{list_2}\nПроизведение всех четных элементов списка\n{reduce(list_1, list_2)}')


Task_6 ______________________________________________________________________________________________



from itertools import count
cycle


print('Выведение осуществится с указанного числа. Для получения следующего за этим нужно нажать "e", для выхода из генерации нажать "x"')
for i in count(int(input('Введите стартовое число -    '))):
    print(i)
    clos = input()
    if clos == 'x':
        break






print('Для повторения введеного списка нажмите "e", для выхода  нажать "x"')
r_list = input('Введите свой список чисел с пробелами-      ').split()
iter = cycle(r_list)
clos = None
while clos != 'x':
    print(next(iter))
    clos = input()



'''


"Мне не удалось решить задачу № 7, можно я еще подумаю и решу ее к понедельнику"